#include "sys.h"

int main()
{
	LED_Init();//LED初始化
	BUZZ_Init();//蜂鸣器初始化
	Realy_Init();//继电器初始化

	while(1)
	{
		int i=0;
		/****************************8 个 LED 灯同时闪烁 3 次*******************************/
		for(i=0;i<3;i++)
		{
			LED_ALL_ON();
			Delay(500);
			LED_ALL_OFF();
			Delay(500);		
		}
		
		/****************************从 L1 灯至 L8 灯依次点亮*******************************/
		for(i=0;i<8;i++)
		{
			P0=0xff<<i;//依次点亮
		}
		/****************************继电器吸合， 延时片刻， 继电器断开*******************************/
		Realy_ON();
		Delay(5000);
		Realy_OFF();
		
		/****************************从 L1 灯至 L8 灯依次熄灭*******************************/
		for(i=0;i<8;i++)
		{
			P0=~(0xff<<i);//依次熄灭
		}
		/****************************蜂鸣器鸣叫一会后关闭*******************************/
		BUZZ_ON();
		Delay(5000);
		BUZZ_OFF();
		/****************************LED0点亮*******************************/
		LED_SHOW(0);

	}
}
