#include <STC15F2K60S2.H>
#include "LED.h"
/**
  ************************************************************************** 
  ** -------------------------------------------------------------------- **
  ** @name          : ms延时
  ** @brief         : None
  ** @param         : None
  ** @retval        : None
  ** @author        : SmallBit886
  ** -------------------------------------------------------------------- **
  ** @attention     : None
  ** -------------------------------------------------------------------- **
  ************************************************************************** 
**/
void Delay(unsigned int ms)		//@12.000MHz
{
	unsigned char data i, j;
	while(ms)
	{
		i = 2;
		j = 239;
		do
		{
			while (--j);
		} while (--i);
		ms--;	
	}
}

int main()
{
	LED_Init();//初始化
	while(1)
	{
		int i=0;
		for(i=0;i<3;i++)
		{
			LED_ALL_ON();
			Delay(500);
			LED_ALL_OFF();
			Delay(500);		
		}
		for(i=0;i<8;i++)
		{
			P0=0xff<<i;//依次点亮
		}
		for(i=0;i<8;i++)
		{
			P0=~(0xff<<i);//依次熄灭
		}
		
		LED_SHOW(0);
	}

}
